noble1911/pet-esp/firmware/sdkconfig.defaults
# ESP-IDF defaults for the Waveshare ESP32-S3-Touch-AMOLED-1.8.
# Checked in; per-build sdkconfig is generated and gitignored.

CONFIG_IDF_TARGET="esp32s3"

# Flash: 16 MB, QIO (architecture §1)
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y

# Custom partition table (firmware/partitions.csv)
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_FILENAME="partitions.csv"

# PSRAM: 8 MB octal. Sprite buffers (~500 KB, architecture §5.4) live here.
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_USE_MALLOC=y
# Execute code and read constants directly from PSRAM — frees flash for app
# and accelerates large LVGL/sprite working sets.
CONFIG_SPIRAM_FETCH_INSTRUCTIONS=y
CONFIG_SPIRAM_RODATA=y

# Performance: max CPU clock, 64 B cache lines (PSRAM win), -O2-equivalent.
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_ESP32S3_DATA_CACHE_LINE_64B=y
CONFIG_COMPILER_OPTIMIZATION_PERF=y

# 1 kHz tick for smooth UI / animation timing (architecture §5.5)
CONFIG_FREERTOS_HZ=1000

# Main task stack — default 3584 B overflows once the step-5 renderer
# threads its 512 B path buffers through 7-layer composition called from
# ui_init. 8 KB has comfortable headroom for the LVGL widget calls too.
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192

# NVS holds the single Pet blob (architecture §4.1)
CONFIG_NVS_ENCRYPTION=n

# LVGL fonts: enable Montserrat 24 in addition to the 14-point default so
# the step-4 debug overlay is readable from arm's length on the 368x448
# AMOLED.
CONFIG_LV_FONT_MONTSERRAT_24=y
